; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-16)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 room3)
(at ball7 room4)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
(at ball16 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 1 of 16
2. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 1 of 16
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 1 of 16
4. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 2 of 16
5. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 3 of 16
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 3 of 16
7. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 3 of 16
8. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 3 of 16
9. (pick ball16 room6 right)
   deleted: (at ball16 room6) (free right)
   added: (carry ball16 right)
   goals met: 3 of 16
10. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 3 of 16
11. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 4 of 16
12. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 5 of 16
13. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 5 of 16
14. (pick ball15 room6 left)
   deleted: (at ball15 room6) (free left)
   added: (carry ball15 left)
   goals met: 5 of 16
15. (pick ball14 room6 right)
   deleted: (at ball14 room6) (free right)
   added: (carry ball14 right)
   goals met: 5 of 16
16. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 5 of 16
17. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 6 of 16
18. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 7 of 16
19. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 7 of 16
20. (pick ball13 room6 left)
   deleted: (at ball13 room6) (free left)
   added: (carry ball13 left)
   goals met: 7 of 16
21. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 7 of 16
22. (pick ball9 room5 right)
   deleted: (at ball9 room5) (free right)
   added: (carry ball9 right)
   goals met: 7 of 16
23. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 7 of 16
24. (drop ball9 room3 right)
   deleted: (carry ball9 right)
   added: (at ball9 room3) (free right)
   goals met: 8 of 16
25. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 9 of 16
26. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 9 of 16
27. (pick ball8 room5 left)
   deleted: (at ball8 room5) (free left)
   added: (carry ball8 left)
   goals met: 9 of 16
28. (pick ball12 room5 right)
   deleted: (at ball12 room5) (free right)
   added: (carry ball12 right)
   goals met: 9 of 16
29. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 9 of 16
30. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 10 of 16
31. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 11 of 16
32. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 11 of 16
33. (pick ball11 room5 left)
   deleted: (at ball11 room5) (free left)
   added: (carry ball11 left)
   goals met: 11 of 16
34. (pick ball10 room5 right)
   deleted: (at ball10 room5) (free right)
   added: (carry ball10 right)
   goals met: 11 of 16
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 11 of 16
36. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 11 of 16
37. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 12 of 16
38. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 13 of 16
39. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 13 of 16
40. (pick ball7 room4 left)
   deleted: (at ball7 room4) (free left)
   added: (carry ball7 left)
   goals met: 13 of 16
41. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 16
42. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 14 of 16
43. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 16
44. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 14 of 16
45. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 14 of 16
46. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 16
47. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 15 of 16
48. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 16 of 16
